Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/io_bank0.h
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_MSB    _u(17)
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_LSB    _u(17)
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_BANK0_GPIO29_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO29_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_BANK0_GPIO29_STATUS_OETOPAD_MSB    _u(13)
#define IO_BANK0_GPIO29_STATUS_OETOPAD_LSB    _u(13)
#define IO_BANK0_GPIO29_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_LSB    _u(9)
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_ACCESS "RO"
// =============================================================================
// Register    : IO_BANK0_GPIO29_CTRL
#define IO_BANK0_GPIO29_CTRL_OFFSET _u(0x000000ec)
#define IO_BANK0_GPIO29_CTRL_BITS   _u(0x3003f01f)
#define IO_BANK0_GPIO29_CTRL_RESET  _u(0x0000001f)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_CTRL_IRQOVER
//               0x0 -> don't invert the interrupt
//               0x1 -> invert the interrupt
//               0x2 -> drive interrupt low
//               0x3 -> drive interrupt high
#define IO_BANK0_GPIO29_CTRL_IRQOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_BITS   _u(0x30000000)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_MSB    _u(29)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_LSB    _u(28)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_CTRL_INOVER
//               0x0 -> don't invert the peri input
//               0x1 -> invert the peri input
//               0x2 -> drive peri input low
//               0x3 -> drive peri input high
#define IO_BANK0_GPIO29_CTRL_INOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO29_CTRL_INOVER_BITS   _u(0x00030000)
#define IO_BANK0_GPIO29_CTRL_INOVER_MSB    _u(17)
#define IO_BANK0_GPIO29_CTRL_INOVER_LSB    _u(16)
#define IO_BANK0_GPIO29_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_CTRL_OEOVER
//               0x0 -> drive output enable from peripheral signal selected by funcsel
//               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
//               0x2 -> disable output
//               0x3 -> enable output
#define IO_BANK0_GPIO29_CTRL_OEOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO29_CTRL_OEOVER_BITS   _u(0x0000c000)
#define IO_BANK0_GPIO29_CTRL_OEOVER_MSB    _u(15)
#define IO_BANK0_GPIO29_CTRL_OEOVER_LSB    _u(14)
#define IO_BANK0_GPIO29_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_DISABLE _u(0x2)
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_ENABLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_CTRL_OUTOVER
//               0x0 -> drive output from peripheral signal selected by funcsel
//               0x1 -> drive output from inverse of peripheral signal selected by funcsel
//               0x2 -> drive output low
//               0x3 -> drive output high
#define IO_BANK0_GPIO29_CTRL_OUTOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_BITS   _u(0x00003000)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_MSB    _u(13)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_LSB    _u(12)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO29_CTRL_FUNCSEL
// Description : 0-31 -> selects pin function according to the gpio table
//               31 == NULL
//               0x01 -> spi1_ss_n
//               0x02 -> uart0_rx
//               0x03 -> i2c0_scl
//               0x04 -> pwm_b_6
//               0x05 -> siob_proc_29
//               0x06 -> pio0_29
//               0x07 -> pio1_29
//               0x08 -> pio2_29
//               0x0a -> usb_muxing_vbus_en
//               0x1f -> null
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_RESET  _u(0x1f)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_BITS   _u(0x0000001f)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_MSB    _u(4)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_LSB    _u(0)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_SPI1_SS_N _u(0x01)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_UART0_RX _u(0x02)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_I2C0_SCL _u(0x03)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PWM_B_6 _u(0x04)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_SIOB_PROC_29 _u(0x05)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PIO0_29 _u(0x06)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PIO1_29 _u(0x07)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PIO2_29 _u(0x08)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN _u(0x0a)
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_NULL _u(0x1f)
// =============================================================================
// Register    : IO_BANK0_GPIO30_STATUS
#define IO_BANK0_GPIO30_STATUS_OFFSET _u(0x000000f0)
#define IO_BANK0_GPIO30_STATUS_BITS   _u(0x04022200)
#define IO_BANK0_GPIO30_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_MSB    _u(17)
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_LSB    _u(17)
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_BANK0_GPIO30_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO30_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_BANK0_GPIO30_STATUS_OETOPAD_MSB    _u(13)
#define IO_BANK0_GPIO30_STATUS_OETOPAD_LSB    _u(13)
#define IO_BANK0_GPIO30_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_LSB    _u(9)
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_ACCESS "RO"
// =============================================================================
// Register    : IO_BANK0_GPIO30_CTRL
#define IO_BANK0_GPIO30_CTRL_OFFSET _u(0x000000f4)
#define IO_BANK0_GPIO30_CTRL_BITS   _u(0x3003f01f)
#define IO_BANK0_GPIO30_CTRL_RESET  _u(0x0000001f)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_CTRL_IRQOVER
//               0x0 -> don't invert the interrupt
//               0x1 -> invert the interrupt
//               0x2 -> drive interrupt low
//               0x3 -> drive interrupt high
#define IO_BANK0_GPIO30_CTRL_IRQOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_BITS   _u(0x30000000)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_MSB    _u(29)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_LSB    _u(28)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_CTRL_INOVER
//               0x0 -> don't invert the peri input
//               0x1 -> invert the peri input
//               0x2 -> drive peri input low
//               0x3 -> drive peri input high
#define IO_BANK0_GPIO30_CTRL_INOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO30_CTRL_INOVER_BITS   _u(0x00030000)
#define IO_BANK0_GPIO30_CTRL_INOVER_MSB    _u(17)
#define IO_BANK0_GPIO30_CTRL_INOVER_LSB    _u(16)
#define IO_BANK0_GPIO30_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_CTRL_OEOVER
//               0x0 -> drive output enable from peripheral signal selected by funcsel
//               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
//               0x2 -> disable output
//               0x3 -> enable output
#define IO_BANK0_GPIO30_CTRL_OEOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO30_CTRL_OEOVER_BITS   _u(0x0000c000)
#define IO_BANK0_GPIO30_CTRL_OEOVER_MSB    _u(15)
#define IO_BANK0_GPIO30_CTRL_OEOVER_LSB    _u(14)
#define IO_BANK0_GPIO30_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_DISABLE _u(0x2)
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_ENABLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_CTRL_OUTOVER
//               0x0 -> drive output from peripheral signal selected by funcsel
//               0x1 -> drive output from inverse of peripheral signal selected by funcsel
//               0x2 -> drive output low
//               0x3 -> drive output high
#define IO_BANK0_GPIO30_CTRL_OUTOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_BITS   _u(0x00003000)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_MSB    _u(13)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_LSB    _u(12)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO30_CTRL_FUNCSEL
// Description : 0-31 -> selects pin function according to the gpio table
//               31 == NULL
//               0x01 -> spi1_sclk
//               0x02 -> uart0_cts
//               0x03 -> i2c1_sda
//               0x04 -> pwm_a_7
//               0x05 -> siob_proc_30
//               0x06 -> pio0_30
//               0x07 -> pio1_30
//               0x08 -> pio2_30
//               0x0a -> usb_muxing_overcurr_detect
//               0x0b -> uart0_tx
//               0x1f -> null
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_RESET  _u(0x1f)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_BITS   _u(0x0000001f)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_MSB    _u(4)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_LSB    _u(0)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_SPI1_SCLK _u(0x01)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_UART0_CTS _u(0x02)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_I2C1_SDA _u(0x03)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PWM_A_7 _u(0x04)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_SIOB_PROC_30 _u(0x05)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PIO0_30 _u(0x06)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PIO1_30 _u(0x07)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PIO2_30 _u(0x08)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT _u(0x0a)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_UART0_TX _u(0x0b)
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_NULL _u(0x1f)
// =============================================================================
// Register    : IO_BANK0_GPIO31_STATUS
#define IO_BANK0_GPIO31_STATUS_OFFSET _u(0x000000f8)
#define IO_BANK0_GPIO31_STATUS_BITS   _u(0x04022200)
#define IO_BANK0_GPIO31_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_MSB    _u(17)
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_LSB    _u(17)
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_BANK0_GPIO31_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO31_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_BANK0_GPIO31_STATUS_OETOPAD_MSB    _u(13)
#define IO_BANK0_GPIO31_STATUS_OETOPAD_LSB    _u(13)
#define IO_BANK0_GPIO31_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_LSB    _u(9)
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_ACCESS "RO"
// =============================================================================
// Register    : IO_BANK0_GPIO31_CTRL
#define IO_BANK0_GPIO31_CTRL_OFFSET _u(0x000000fc)
#define IO_BANK0_GPIO31_CTRL_BITS   _u(0x3003f01f)
#define IO_BANK0_GPIO31_CTRL_RESET  _u(0x0000001f)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_CTRL_IRQOVER
//               0x0 -> don't invert the interrupt
//               0x1 -> invert the interrupt
//               0x2 -> drive interrupt low
//               0x3 -> drive interrupt high
#define IO_BANK0_GPIO31_CTRL_IRQOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_BITS   _u(0x30000000)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_MSB    _u(29)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_LSB    _u(28)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_CTRL_INOVER
//               0x0 -> don't invert the peri input
//               0x1 -> invert the peri input
//               0x2 -> drive peri input low
//               0x3 -> drive peri input high
#define IO_BANK0_GPIO31_CTRL_INOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO31_CTRL_INOVER_BITS   _u(0x00030000)
#define IO_BANK0_GPIO31_CTRL_INOVER_MSB    _u(17)
#define IO_BANK0_GPIO31_CTRL_INOVER_LSB    _u(16)
#define IO_BANK0_GPIO31_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_CTRL_OEOVER
//               0x0 -> drive output enable from peripheral signal selected by funcsel
//               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
//               0x2 -> disable output
//               0x3 -> enable output
#define IO_BANK0_GPIO31_CTRL_OEOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO31_CTRL_OEOVER_BITS   _u(0x0000c000)
#define IO_BANK0_GPIO31_CTRL_OEOVER_MSB    _u(15)
#define IO_BANK0_GPIO31_CTRL_OEOVER_LSB    _u(14)
#define IO_BANK0_GPIO31_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_DISABLE _u(0x2)
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_ENABLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_CTRL_OUTOVER
//               0x0 -> drive output from peripheral signal selected by funcsel
//               0x1 -> drive output from inverse of peripheral signal selected by funcsel
//               0x2 -> drive output low
//               0x3 -> drive output high
#define IO_BANK0_GPIO31_CTRL_OUTOVER_RESET  _u(0x0)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_BITS   _u(0x00003000)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_MSB    _u(13)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_LSB    _u(12)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_NORMAL _u(0x0)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_INVERT _u(0x1)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_LOW _u(0x2)
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO31_CTRL_FUNCSEL
// Description : 0-31 -> selects pin function according to the gpio table
//               31 == NULL
//               0x01 -> spi1_tx
//               0x02 -> uart0_rts
//               0x03 -> i2c1_scl
//               0x04 -> pwm_b_7
//               0x05 -> siob_proc_31
//               0x06 -> pio0_31
//               0x07 -> pio1_31
//               0x08 -> pio2_31
//               0x0a -> usb_muxing_vbus_detect
//               0x0b -> uart0_rx
//               0x1f -> null
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_RESET  _u(0x1f)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_BITS   _u(0x0000001f)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_MSB    _u(4)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_LSB    _u(0)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_SPI1_TX _u(0x01)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_UART0_RTS _u(0x02)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_I2C1_SCL _u(0x03)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PWM_B_7 _u(0x04)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_SIOB_PROC_31 _u(0x05)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PIO0_31 _u(0x06)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PIO1_31 _u(0x07)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PIO2_31 _u(0x08)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT _u(0x0a)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_UART0_RX _u(0x0b)
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_NULL _u(0x1f)
// =============================================================================
// Register    : IO_BANK0_GPIO32_STATUS
#define IO_BANK0_GPIO32_STATUS_OFFSET _u(0x00000100)
#define IO_BANK0_GPIO32_STATUS_BITS   _u(0x04022200)
#define IO_BANK0_GPIO32_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO32_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO32_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_MSB    _u(17)
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_LSB    _u(17)
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO32_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_BANK0_GPIO32_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO32_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_BANK0_GPIO32_STATUS_OETOPAD_MSB    _u(13)
#define IO_BANK0_GPIO32_STATUS_OETOPAD_LSB    _u(13)
#define IO_BANK0_GPIO32_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_GPIO32_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_LSB    _u(9)
