Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/io_bank0.h
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_LSB    _u(17)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_BITS   _u(0x00010000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_MSB    _u(16)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_LSB    _u(16)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_BITS   _u(0x00008000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_MSB    _u(15)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_LSB    _u(15)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_BITS   _u(0x00004000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_MSB    _u(14)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_LSB    _u(14)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_BITS   _u(0x00002000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_MSB    _u(13)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_LSB    _u(13)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_BITS   _u(0x00001000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_MSB    _u(12)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_LSB    _u(12)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_BITS   _u(0x00000800)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_MSB    _u(11)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_LSB    _u(11)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_BITS   _u(0x00000400)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_MSB    _u(10)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_LSB    _u(10)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_BITS   _u(0x00000200)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_MSB    _u(9)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_LSB    _u(9)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_BITS   _u(0x00000100)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_MSB    _u(8)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_LSB    _u(8)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_BITS   _u(0x00000080)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_MSB    _u(7)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_LSB    _u(7)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_BITS   _u(0x00000040)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_MSB    _u(6)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_LSB    _u(6)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_BITS   _u(0x00000020)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_MSB    _u(5)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_LSB    _u(5)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_BITS   _u(0x00000010)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_MSB    _u(4)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_LSB    _u(4)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_BITS   _u(0x00000008)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_MSB    _u(3)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_LSB    _u(3)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_BITS   _u(0x00000004)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_MSB    _u(2)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_LSB    _u(2)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_BITS   _u(0x00000002)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_MSB    _u(1)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_LSB    _u(1)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_BITS   _u(0x00000001)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_MSB    _u(0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_LSB    _u(0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_ACCESS "RO"
// =============================================================================
// Register    : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_OFFSET _u(0x0000021c)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_BITS   _u(0x0000ffff)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_BITS   _u(0x00008000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_MSB    _u(15)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_LSB    _u(15)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_BITS   _u(0x00004000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_MSB    _u(14)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_LSB    _u(14)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_BITS   _u(0x00002000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_MSB    _u(13)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_LSB    _u(13)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_BITS   _u(0x00001000)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_MSB    _u(12)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_LSB    _u(12)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_BITS   _u(0x00000800)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_MSB    _u(11)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_LSB    _u(11)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_BITS   _u(0x00000400)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_MSB    _u(10)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_LSB    _u(10)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_BITS   _u(0x00000200)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_MSB    _u(9)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_LSB    _u(9)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_BITS   _u(0x00000100)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_MSB    _u(8)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_LSB    _u(8)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_BITS   _u(0x00000080)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_MSB    _u(7)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_LSB    _u(7)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_BITS   _u(0x00000040)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_MSB    _u(6)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_LSB    _u(6)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_BITS   _u(0x00000020)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_MSB    _u(5)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_LSB    _u(5)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_BITS   _u(0x00000010)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_MSB    _u(4)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_LSB    _u(4)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_BITS   _u(0x00000008)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_MSB    _u(3)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_LSB    _u(3)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_BITS   _u(0x00000004)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_MSB    _u(2)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_LSB    _u(2)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_BITS   _u(0x00000002)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_MSB    _u(1)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_LSB    _u(1)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_BITS   _u(0x00000001)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_MSB    _u(0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_LSB    _u(0)
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_ACCESS "RO"
// =============================================================================
// Register    : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_OFFSET _u(0x00000220)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_BITS   _u(0xffffffff)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_BITS   _u(0x80000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_MSB    _u(31)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_LSB    _u(31)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_BITS   _u(0x40000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_MSB    _u(30)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_LSB    _u(30)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_BITS   _u(0x20000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_MSB    _u(29)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_LSB    _u(29)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_BITS   _u(0x10000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_MSB    _u(28)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_LSB    _u(28)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_BITS   _u(0x08000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_MSB    _u(27)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_LSB    _u(27)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_BITS   _u(0x04000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_MSB    _u(26)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_LSB    _u(26)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_BITS   _u(0x02000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_MSB    _u(25)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_LSB    _u(25)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_BITS   _u(0x01000000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_MSB    _u(24)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_LSB    _u(24)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_BITS   _u(0x00800000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_MSB    _u(23)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_LSB    _u(23)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_BITS   _u(0x00400000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_MSB    _u(22)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_LSB    _u(22)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_BITS   _u(0x00200000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_MSB    _u(21)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_LSB    _u(21)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_BITS   _u(0x00100000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_MSB    _u(20)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_LSB    _u(20)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_BITS   _u(0x00080000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_MSB    _u(19)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_LSB    _u(19)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_BITS   _u(0x00040000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_MSB    _u(18)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_LSB    _u(18)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_RESET  _u(0x0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_BITS   _u(0x00020000)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_MSB    _u(17)
