Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/io_bank0.h
#define IO_BANK0_PROC1_INTF4_GPIO39_EDGE_LOW_LSB    _u(30)
#define IO_BANK0_PROC1_INTF4_GPIO39_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_HIGH_BITS   _u(0x20000000)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_HIGH_MSB    _u(29)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_HIGH_LSB    _u(29)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_LOW_BITS   _u(0x10000000)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_LOW_MSB    _u(28)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_LOW_LSB    _u(28)
#define IO_BANK0_PROC1_INTF4_GPIO39_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO38_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_HIGH_BITS   _u(0x08000000)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_HIGH_MSB    _u(27)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_HIGH_LSB    _u(27)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO38_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_LOW_BITS   _u(0x04000000)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_LOW_MSB    _u(26)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_LOW_LSB    _u(26)
#define IO_BANK0_PROC1_INTF4_GPIO38_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_HIGH_BITS   _u(0x02000000)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_HIGH_MSB    _u(25)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_HIGH_LSB    _u(25)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_LOW_BITS   _u(0x01000000)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_LOW_MSB    _u(24)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_LOW_LSB    _u(24)
#define IO_BANK0_PROC1_INTF4_GPIO38_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO37_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_HIGH_BITS   _u(0x00800000)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_HIGH_MSB    _u(23)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_HIGH_LSB    _u(23)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO37_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_LOW_BITS   _u(0x00400000)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_LOW_MSB    _u(22)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_LOW_LSB    _u(22)
#define IO_BANK0_PROC1_INTF4_GPIO37_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_HIGH_BITS   _u(0x00200000)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_HIGH_MSB    _u(21)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_HIGH_LSB    _u(21)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_LOW_BITS   _u(0x00100000)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_LOW_MSB    _u(20)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_LOW_LSB    _u(20)
#define IO_BANK0_PROC1_INTF4_GPIO37_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO36_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_HIGH_BITS   _u(0x00080000)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_HIGH_MSB    _u(19)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_HIGH_LSB    _u(19)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO36_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_LOW_BITS   _u(0x00040000)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_LOW_MSB    _u(18)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_LOW_LSB    _u(18)
#define IO_BANK0_PROC1_INTF4_GPIO36_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_HIGH_BITS   _u(0x00020000)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_HIGH_MSB    _u(17)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_HIGH_LSB    _u(17)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_LOW_BITS   _u(0x00010000)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_LOW_MSB    _u(16)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_LOW_LSB    _u(16)
#define IO_BANK0_PROC1_INTF4_GPIO36_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO35_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_HIGH_BITS   _u(0x00008000)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_HIGH_MSB    _u(15)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_HIGH_LSB    _u(15)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO35_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_LOW_BITS   _u(0x00004000)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_LOW_MSB    _u(14)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_LOW_LSB    _u(14)
#define IO_BANK0_PROC1_INTF4_GPIO35_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_HIGH_BITS   _u(0x00002000)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_HIGH_MSB    _u(13)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_HIGH_LSB    _u(13)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_LOW_BITS   _u(0x00001000)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_LOW_MSB    _u(12)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_LOW_LSB    _u(12)
#define IO_BANK0_PROC1_INTF4_GPIO35_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO34_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_HIGH_BITS   _u(0x00000800)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_HIGH_MSB    _u(11)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_HIGH_LSB    _u(11)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO34_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_LOW_BITS   _u(0x00000400)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_LOW_MSB    _u(10)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_LOW_LSB    _u(10)
#define IO_BANK0_PROC1_INTF4_GPIO34_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_HIGH_BITS   _u(0x00000200)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_HIGH_MSB    _u(9)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_HIGH_LSB    _u(9)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_LOW_BITS   _u(0x00000100)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_LOW_MSB    _u(8)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_LOW_LSB    _u(8)
#define IO_BANK0_PROC1_INTF4_GPIO34_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO33_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_HIGH_BITS   _u(0x00000080)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_HIGH_MSB    _u(7)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_HIGH_LSB    _u(7)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO33_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_LOW_BITS   _u(0x00000040)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_LOW_MSB    _u(6)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_LOW_LSB    _u(6)
#define IO_BANK0_PROC1_INTF4_GPIO33_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_HIGH_BITS   _u(0x00000020)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_HIGH_MSB    _u(5)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_HIGH_LSB    _u(5)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_LOW_BITS   _u(0x00000010)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_LOW_MSB    _u(4)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_LOW_LSB    _u(4)
#define IO_BANK0_PROC1_INTF4_GPIO33_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO32_EDGE_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_HIGH_BITS   _u(0x00000008)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_HIGH_MSB    _u(3)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_HIGH_LSB    _u(3)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO32_EDGE_LOW
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_LOW_BITS   _u(0x00000004)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_LOW_MSB    _u(2)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_LOW_LSB    _u(2)
#define IO_BANK0_PROC1_INTF4_GPIO32_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_HIGH_BITS   _u(0x00000002)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_HIGH_MSB    _u(1)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_HIGH_LSB    _u(1)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_LOW
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_LOW_BITS   _u(0x00000001)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_LOW_MSB    _u(0)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_LOW_LSB    _u(0)
#define IO_BANK0_PROC1_INTF4_GPIO32_LEVEL_LOW_ACCESS "RW"
// =============================================================================
// Register    : IO_BANK0_PROC1_INTF5
// Description : Interrupt Force for proc1
#define IO_BANK0_PROC1_INTF5_OFFSET _u(0x000002bc)
#define IO_BANK0_PROC1_INTF5_BITS   _u(0xffffffff)
#define IO_BANK0_PROC1_INTF5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO47_EDGE_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_HIGH_BITS   _u(0x80000000)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_HIGH_MSB    _u(31)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_HIGH_LSB    _u(31)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO47_EDGE_LOW
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_LOW_BITS   _u(0x40000000)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_LOW_MSB    _u(30)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_LOW_LSB    _u(30)
#define IO_BANK0_PROC1_INTF5_GPIO47_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_HIGH_BITS   _u(0x20000000)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_HIGH_MSB    _u(29)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_HIGH_LSB    _u(29)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_LOW
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_LOW_BITS   _u(0x10000000)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_LOW_MSB    _u(28)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_LOW_LSB    _u(28)
#define IO_BANK0_PROC1_INTF5_GPIO47_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO46_EDGE_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_HIGH_BITS   _u(0x08000000)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_HIGH_MSB    _u(27)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_HIGH_LSB    _u(27)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO46_EDGE_LOW
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_LOW_BITS   _u(0x04000000)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_LOW_MSB    _u(26)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_LOW_LSB    _u(26)
#define IO_BANK0_PROC1_INTF5_GPIO46_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_HIGH_BITS   _u(0x02000000)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_HIGH_MSB    _u(25)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_HIGH_LSB    _u(25)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_LOW
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_LOW_BITS   _u(0x01000000)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_LOW_MSB    _u(24)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_LOW_LSB    _u(24)
#define IO_BANK0_PROC1_INTF5_GPIO46_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO45_EDGE_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_HIGH_BITS   _u(0x00800000)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_HIGH_MSB    _u(23)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_HIGH_LSB    _u(23)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO45_EDGE_LOW
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_LOW_BITS   _u(0x00400000)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_LOW_MSB    _u(22)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_LOW_LSB    _u(22)
#define IO_BANK0_PROC1_INTF5_GPIO45_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_HIGH_BITS   _u(0x00200000)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_HIGH_MSB    _u(21)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_HIGH_LSB    _u(21)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_LOW
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_LOW_BITS   _u(0x00100000)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_LOW_MSB    _u(20)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_LOW_LSB    _u(20)
#define IO_BANK0_PROC1_INTF5_GPIO45_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO44_EDGE_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_HIGH_BITS   _u(0x00080000)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_HIGH_MSB    _u(19)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_HIGH_LSB    _u(19)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO44_EDGE_LOW
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_LOW_BITS   _u(0x00040000)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_LOW_MSB    _u(18)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_LOW_LSB    _u(18)
#define IO_BANK0_PROC1_INTF5_GPIO44_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_HIGH_BITS   _u(0x00020000)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_HIGH_MSB    _u(17)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_HIGH_LSB    _u(17)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_LOW
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_LOW_BITS   _u(0x00010000)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_LOW_MSB    _u(16)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_LOW_LSB    _u(16)
#define IO_BANK0_PROC1_INTF5_GPIO44_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO43_EDGE_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_HIGH_BITS   _u(0x00008000)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_HIGH_MSB    _u(15)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_HIGH_LSB    _u(15)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO43_EDGE_LOW
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_LOW_BITS   _u(0x00004000)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_LOW_MSB    _u(14)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_LOW_LSB    _u(14)
#define IO_BANK0_PROC1_INTF5_GPIO43_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_HIGH_BITS   _u(0x00002000)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_HIGH_MSB    _u(13)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_HIGH_LSB    _u(13)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_LOW
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_LOW_BITS   _u(0x00001000)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_LOW_MSB    _u(12)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_LOW_LSB    _u(12)
#define IO_BANK0_PROC1_INTF5_GPIO43_LEVEL_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO42_EDGE_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_HIGH_BITS   _u(0x00000800)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_HIGH_MSB    _u(11)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_HIGH_LSB    _u(11)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO42_EDGE_LOW
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_LOW_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_LOW_BITS   _u(0x00000400)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_LOW_MSB    _u(10)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_LOW_LSB    _u(10)
#define IO_BANK0_PROC1_INTF5_GPIO42_EDGE_LOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : IO_BANK0_PROC1_INTF5_GPIO42_LEVEL_HIGH
#define IO_BANK0_PROC1_INTF5_GPIO42_LEVEL_HIGH_RESET  _u(0x0)
#define IO_BANK0_PROC1_INTF5_GPIO42_LEVEL_HIGH_BITS   _u(0x00000200)
#define IO_BANK0_PROC1_INTF5_GPIO42_LEVEL_HIGH_MSB    _u(9)
#define IO_BANK0_PROC1_INTF5_GPIO42_LEVEL_HIGH_LSB    _u(9)
#define IO_BANK0_PROC1_INTF5_GPIO42_LEVEL_HIGH_ACCESS "RW"
// -----------------------------------------------------------------------------
